# Heroes Of Pymoli Data Analysis

### Heroes Of Pymoli Data Analysis
* While most of the players are male, females spend more (9.8%) per person on items. 
* Players in the age range of 35 to 39 spent 





* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).

In [95]:
import pandas as pd
import numpy as np

file_to_load = "Resources/purchase_data.csv"

purchase_data = pd.read_csv(file_to_load)
nodupe_purchase_data = pd.read_csv(file_to_load)

In [96]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [97]:
#####################################################################

In [98]:
#Get count of unique screen names

In [99]:

total_players =purchase_data["SN"].nunique()
#insert count into a new DF
player_df = pd.DataFrame(
    {"Total Players": [total_players]
     }
)
player_df

   Total Players
0            576

In [100]:
#####################################################################

In [101]:
## Purchasing Analysis (Total)

In [102]:
unique_items =purchase_data["Item ID"].nunique()
avg_price = purchase_data["Price"].mean()
avg_price = round(avg_price,2)
total_rev = purchase_data["Price"].sum()
count_purchase =purchase_data["Price"].count()

In [103]:
purchase_analysis = pd.DataFrame(
    {"Number of Unique Items": [unique_items],
     "Average Price": [avg_price],
     "Number of Purchases": [count_purchase],
     "Total Revenue": [total_rev],
     }
)
purchase_analysis

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     183           3.05                  780        2379.77

In [104]:
#####################################################################

In [105]:
## Gender Demographics

In [106]:
nodupe_purchase_data.drop_duplicates(subset ='SN',inplace=True)

In [107]:
genders = nodupe_purchase_data["Gender"]
total_count = nodupe_purchase_data["Gender"].value_counts()
df = pd.DataFrame(total_count)

In [108]:
percent = round(df['Gender']/df['Gender'].sum()*100,2)
# percent = pd.DataFrame(percent)
gender_demo = pd.concat([df,percent], axis = 1)
gender_demo.columns = ['Gender', 'Percentage of Players']
gender_demo

                       Gender  Percentage of Players
Male                      484                  84.03
Female                     81                  14.06
Other / Non-Disclosed      11                   1.91

In [109]:
#####################################################################

In [110]:
## Purchasing Analysis (Gender)

In [111]:
purch_analysis = purchase_data.groupby(["Gender"])
purch_count = purch_analysis["SN"].count()
purch_avg = purch_analysis["Price"].mean()
purch_total = purch_analysis["Price"].sum()
person = purch_analysis["SN"].nunique()
avg_purch_total = (purch_total / person )

In [112]:
this_took_forever = pd.DataFrame({"Purchase Count": purch_count,
                                    "Average Purchase Price": purch_avg,
                                    "Total Purchase Value":purch_total,
                                    "Avg Total Purchase per Person":avg_purch_total
                                   })
this_took_forever.head()

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [113]:
print(purchase_data["Age"].max())

45

In [114]:
print(purchase_data["Age"].min())

7

In [115]:
#####################################################################

In [116]:
## Age Demographics

In [117]:
age_group = nodupe_purchase_data.groupby("Age")
bins = [0, 9, 14, 19, 24, 29, 34, 39, 99]
group_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34",
                "35-39", "40+"]

In [118]:
nodupe_purchase_data["Age Data"] = pd.cut(nodupe_purchase_data["Age"], bins, labels=group_labels)

In [119]:
age_group = nodupe_purchase_data.groupby("Age Data")

In [120]:
total_counts = age_group["Gender"].count()
person = age_group["SN"].nunique()
purch_total = age_group["Age"].sum()
total_countsum = age_group["Gender"].count().sum()
percent_players = (person / total_countsum )

not_another_df = pd.DataFrame({"Total Count": total_counts,
                               "Percentage of Players": percent_players
                                   })
not_another_df

          Total Count  Percentage of Players
Age Data
<10                17               0.029514
10-14              22               0.038194
15-19             107               0.185764
20-24             258               0.447917
25-29              77               0.133681
30-34              52               0.090278
35-39              31               0.053819
40+                12               0.020833

In [121]:
#####################################################################

In [122]:
## Purchasing Analysis (Age)

In [123]:
purchase_data["Age Data"] = pd.cut(purchase_data["Age"], bins, labels=group_labels)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Data
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [124]:
purch_analysis_age = purchase_data.groupby("Age Data")
bins = [0, 9, 14, 19, 24, 29, 34, 39, 99]
group_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34",
                "35-39", "40+"]

In [125]:
purch_count = purch_analysis_age["SN"].count()
purch_avg = purch_analysis_age["Price"].mean()
purch_total = purch_analysis_age["Price"].sum()
persons = purch_analysis_age["SN"].nunique()
avg_purch_total = (purch_total / persons )

In [126]:
purch_analysis_age_df = pd.DataFrame({"Purchase Count": purch_count,
                                    "Average Purchase Price": purch_avg,
                                    "Total Purchase Value":purch_total,
                                    "Avg Total Purchase per Person":avg_purch_total
                                   })
purch_analysis_age_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Data,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

In [127]:
#####################################################################

In [128]:
####Top Spenders

In [129]:
purchase_data.reset_index()
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Data
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [130]:
big_money = purchase_data.groupby("SN")


purchase_count_spender = big_money["SN"].count()
purch_price_avg_spender = big_money["Price"].mean()
purch_total_spender = big_money["Price"].sum()

big_money_spenders = pd.DataFrame({"Purchase Count": purchase_count_spender,
                                   "Average Purchase Price": purch_price_avg_spender,
                                   "Total Purchase Value":purch_total_spender,
                                   })
big_money_spenders.head()

              Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76               1                    2.28                  2.28
Adastirin33                1                    4.48                  4.48
Aeda94                     1                    4.91                  4.91
Aela59                     1                    4.32                  4.32
Aelaria33                  1                    1.79                  1.79

In [131]:
big_money_spenders.sort_values("Total Purchase Value", ascending=False).head()

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

## Most Profitable Items

In [133]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Data
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [134]:
popular = purchase_data.groupby(['Item ID','Item Name'])

In [135]:
popular_purchase_count = popular["SN"].count()
popular_purchase_value = popular["Price"].sum()
popular_items_price = popular["Price"].max()

In [138]:
most_popular = pd.DataFrame({"Purchase Count": popular_purchase_count,
                                   "Item Price": popular_items_price,
                                    "Total Purchase Value":popular_purchase_value,
                                   })

In [137]:
most_popular['Item Price']= most_popular['Item Price'].map('${:,.2f}'.format)
most_popular['Total Purchase Value']= most_popular['Total Purchase Value'].map('${:,.2f}'.format)
most_popular.sort_values("Total Purchase Value", ascending=False).head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
63,Stormfury Mace,2,$4.99,$9.98
29,"Chaos, Ender of the End",5,$1.98,$9.90
173,Stormfury Longsword,2,$4.93,$9.86
1,Crucifer,3,$3.26,$9.78
38,"The Void, Vengeance of Dark Magic",4,$2.37,$9.48